



Open Shortest Path First IGP                              P. Psenak, Ed.
Internet-Draft                                           S. Previdi, Ed.
Intended status: Standards Track                             C. Filsfils
Expires: April 23, 2018                              Cisco Systems, Inc.
                                                              H. Gredler
                                                            RtBrick Inc.
                                                               R. Shakir
                                                            Google, Inc.
                                                           W. Henderickx
                                                                   Nokia
                                                             J. Tantsura
                                                              Individual
                                                        October 20, 2017


                  OSPF Extensions for Segment Routing
             draft-ietf-ospf-segment-routing-extensions-20

Abstract

   Segment Routing (SR) allows a flexible definition of end-to-end paths
   within IGP topologies by encoding paths as sequences of topological
   sub-paths, called "segments".  These segments are advertised by the
   link-state routing protocols (IS-IS and OSPF).

   This draft describes the OSPF extensions required for Segment
   Routing.

Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."



Psenak, et al.           Expires April 23, 2018                 [Page 1]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


   This Internet-Draft will expire on April 23, 2018.

Copyright Notice

   Copyright (c) 2017 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3
   2.  Segment Routing Identifiers . . . . . . . . . . . . . . . . .   3
     2.1.  SID/Label Sub-TLV . . . . . . . . . . . . . . . . . . . .   4
   3.  Segment Routing Capabilities  . . . . . . . . . . . . . . . .   4
     3.1.  SR-Algorithm TLV  . . . . . . . . . . . . . . . . . . . .   4
     3.2.  SID/Label Range TLV . . . . . . . . . . . . . . . . . . .   6
     3.3.  SR Local Block TLV  . . . . . . . . . . . . . . . . . . .   8
     3.4.  SRMS Preference TLV . . . . . . . . . . . . . . . . . . .  10
   4.  OSPF Extended Prefix Range TLV  . . . . . . . . . . . . . . .  11
   5.  Prefix SID Sub-TLV  . . . . . . . . . . . . . . . . . . . . .  13
   6.  Adjacency Segment Identifier (Adj-SID)  . . . . . . . . . . .  16
     6.1.  Adj-SID Sub-TLV . . . . . . . . . . . . . . . . . . . . .  16
     6.2.  LAN Adj-SID Sub-TLV . . . . . . . . . . . . . . . . . . .  18
   7.  Elements of Procedure . . . . . . . . . . . . . . . . . . . .  19
     7.1.  Intra-area Segment routing in OSPFv2  . . . . . . . . . .  19
     7.2.  Inter-area Segment routing in OSPFv2  . . . . . . . . . .  20
     7.3.  Segment Routing for External Prefixes . . . . . . . . . .  21
     7.4.  Advertisement of Adj-SID  . . . . . . . . . . . . . . . .  21
       7.4.1.  Advertisement of Adj-SID on Point-to-Point Links  . .  21
       7.4.2.  Adjacency SID on Broadcast or NBMA Interfaces . . . .  21
   8.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  22
     8.1.  OSPF OSPF Router Information (RI) TLVs Registry . . . . .  22
     8.2.  OSPF Extended Prefix LSA TLV Registry . . . . . . . . . .  22
     8.3.  OSPF Extended Prefix LSA Sub-TLV Registry . . . . . . . .  22
     8.4.  OSPF Extended Link LSA Sub-TLV Registry . . . . . . . . .  22
     8.5.  SR-Algorithm Registry . . . . . . . . . . . . . . . . . .  23
   9.  Implementation Status . . . . . . . . . . . . . . . . . . . .  23
   10. Security Considerations . . . . . . . . . . . . . . . . . . .  25
   11. Contributors  . . . . . . . . . . . . . . . . . . . . . . . .  25



Psenak, et al.           Expires April 23, 2018                 [Page 2]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


   12. Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  25
   13. References  . . . . . . . . . . . . . . . . . . . . . . . . .  25
     13.1.  Normative References . . . . . . . . . . . . . . . . . .  26
     13.2.  Informative References . . . . . . . . . . . . . . . . .  26
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  27

1.  Introduction

   Segment Routing (SR) allows a flexible definition of end-to-end paths
   within IGP topologies by encoding paths as sequences of topological
   sub-paths, called "segments".  These segments are advertised by the
   link-state routing protocols (IS-IS and OSPF).  Prefix segments
   represent an ECMP-aware shortest-path to a prefix (or a node), as per
   the state of the IGP topology.  Adjacency segments represent a hop
   over a specific adjacency between two nodes in the IGP.  A prefix
   segment is typically a multi-hop path while an adjacency segment, in
   most cases, is a one-hop path.  SR's control-plane can be applied to
   both IPv6 and MPLS data-planes, and does not require any additional
   signalling (other than IGP extensions).  The IPv6 data plane is out
   of the scope of this specification - it is not applicable to OSPFv2
   which only supports the IPv4 address-family.  For example, when used
   in MPLS networks, SR paths do not require any LDP or RSVP-TE
   signalling.  However, SR can interoperate in the presence of LSPs
   established with RSVP or LDP.

   There are additional segment types, e.g., Binding SID defined in
   [I-D.ietf-spring-segment-routing].

   This draft describes the OSPF extensions required for Segment
   Routing.

   Segment Routing architecture is described in
   [I-D.ietf-spring-segment-routing].

   Segment Routing use cases are described in [RFC7855].

2.  Segment Routing Identifiers

   Segment Routing defines various types of Segment Identifiers (SIDs):
   Prefix-SID, Adjacency-SID, LAN Adjacency SID, and Binding SID.

   Extended Prefix/Link Opaque LSAs defined in [RFC7684] are used for
   advertisements of the various SID types.








Psenak, et al.           Expires April 23, 2018                 [Page 3]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


2.1.  SID/Label Sub-TLV

   The SID/Label Sub-TLV appears in multiple TLVs or Sub-TLVs defined
   later in this document.  It is used to advertise the SID or label
   associated with a prefix or adjacency.  The SID/Label Sub-TLV has
   following format:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              Type             |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                         SID/Label (variable)                  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   where:

      Type: 1

      Length: Variable, 3 or 4 octet

      SID/Label: If length is set to 3, then the 20 rightmost bits
      represent a label.  If length is set to 4, then the value
      represents a 32-bit SID.

      The receiving router MUST ignore the SID/Label Sub-TLV if the
      length is other then 3 or 4.

3.  Segment Routing Capabilities

   Segment Routing requires some additional router capabilities to be
   advertised to other routers in the area.

   These SR capabilities are advertised in the Router Information Opaque
   LSA (defined in [RFC7770]).

3.1.  SR-Algorithm TLV

   The SR-Algorithm TLV is a top-level TLV of the Router Information
   Opaque LSA (defined in [RFC7770]).

   The SR-Algorithm TLV is optional.  It SHOULD only be advertised once
   in the Router Information Opaque LSA.  If the SR-Algorithm TLV is not
   advertised by the node, such node is considered as not being segment
   routing capable.

   An SR Router may use various algorithms when calculating reachability
   to OSPF routers or prefixes in an OSPF area.  Examples of these



Psenak, et al.           Expires April 23, 2018                 [Page 4]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


   algorithms are metric based Shortest Path First (SPF), various
   flavors of Constrained SPF, etc.  The SR-Algorithm TLV allows a
   router to advertise the algorithms currently used by the router to
   other routers in an OSPF area.  The SR-Algorithm TLV has following
   format:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              Type             |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Algorithm 1 | Algorithm...  |   Algorithm n |               |
   +-                                                             -+
   |                                                               |
   +                                                               +

   where:

      Type: 8

      Variable, in octets, dependent on number of algorithms advertised.

      Algorithm: Single octet identifying the algorithm.  The following
      values are defined by this document:

         0: Shortest Path First (SPF) algorithm based on link metric.
         This is the standard shortest path algorithm as computed by the
         OSPF protocol.  Consistent with the deployed practice for link-
         state protocols, Algorithm 0 permits any node to overwrite the
         SPF path with a different path based on its local policy.  If
         the SR-Algorithm TLV is advertised, Algorithm 0 MUST be
         included.

         1: Strict Shortest Path First (SPF) algorithm based on link
         metric.  The algorithm is identical to Algorithm 0 but
         Algorithm 1 requires that all nodes along the path will honor
         the SPF routing decision.  Local policy at the node claiming
         support for Algorithm 1 MUST NOT alter the SPF paths computed
         by Algorithm 1.

   When multiple SR-Algorithm TLVs are received from a given router, the
   receiver SHOULD use the first occurrence of the TLV in the Router
   Information LSA.  If the SR-Algorithm TLV appears in multiple Router
   Information LSAs that have different flooding scopes, the SR-
   Algorithm TLV in the Router Information LSA with the area-scoped
   flooding scope SHOULD be used.  If the SR-Algorithm TLV appears in
   multiple Router Information LSAs that have the same flooding scope,
   the SR-Algorithm TLV in the Router Information (RI) LSA with the



Psenak, et al.           Expires April 23, 2018                 [Page 5]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


   numerically smallest Instance ID SHOULD be used and subsequent
   instances of the SR-Algorithm TLV SHOULD be ignored.

   The RI LSA can be advertised at any of the defined opaque flooding
   scopes (link, area, or Autonomous System (AS)).  For the purpose of
   SR-Algorithm TLV advertisement, area-scoped flooding is REQUIRED.

3.2.  SID/Label Range TLV

   Prefix SIDs MAY be advertised in a form of an index as described in
   Section 5.  Such index defines the offset in the SID/Label space
   advertised by the router.  The SID/Label Range TLV is used to
   advertise such SID/Label space.

   The SID/Label Range TLV is a top-level TLV of the Router Information
   Opaque LSA (defined in [RFC7770]).

   The SID/Label Range TLV MAY appear multiple times and has the
   following format:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              Type             |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                    Range Size                 |   Reserved    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        Sub-TLVs (variable)                    |
   +-                                                             -+
   |                                                               |
   +                                                               +

   where:

      Type: 9

      Length: Variable, in octets, dependent on Sub-TLVs.

      Range Size: 3-octet SID/label range size (i.e., the number of SIDs
      or labels in the range including the first SID/label).  It MUST be
      greater than 0.

   Initially, the only supported Sub-TLV is the SID/Label Sub-TLV as
   defined in Section 2.1.  The SID/Label Sub-TLV MUST be included in
   the SID/Label Range TLV.  The SID/Label advertised in the SID/Label
   Sub-TLV represents the first SID/Label in the advertised range.





Psenak, et al.           Expires April 23, 2018                 [Page 6]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


   Only a single SID/Label Sub-TLV MAY be advertised in SID/Label Range
   TLV.  If more then one SID/Label Sub-TLVs are present, the SID/Label
   Range TLV MUST be ignored.

   Multiple occurrences of the SID/Label Range TLV MAY be advertised, in
   order to advertise multiple ranges.  In such case:

   o  The originating router MUST encode each range into a different
      SID/Label Range TLV.

   o  The originating router decides the order in which the set of SID/
      Label Range TLVs are advertised inside the Router Information
      Opaque LSA.  The originating router MUST ensure the order is the
      same after a graceful restart (using checkpointing, non-volatile
      storage, or any other mechanism) in order to assure the SID/label
      range and SID index correspondence is preserved across graceful
      restarts.

   o  The receiving router MUST adhere to the order in which the ranges
      are advertised when calculating a SID/label from a SID index.

   o  The originating router MUST NOT advertise overlapping ranges.

   o  When a router receives multiple overlapping ranges, it MUST
      conform to the procedures defined in
      [I-D.ietf-spring-conflict-resolution].

   The following example illustrates the advertisement of multiple
   ranges:






















Psenak, et al.           Expires April 23, 2018                 [Page 7]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


      The originating router advertises the following ranges:

         Range 1: Range Size: 100   SID/Label Sub-TLV: 100
         Range 1: Range Size: 100   SID/Label Sub-TLV: 1000
         Range 1: Range Size: 100   SID/Label Sub-TLV: 500

      The receiving routers concatenate the ranges and build the Segment
      Routing Global Block (SRGB) as follows:

      SRGB = [100, 199]
             [1000, 1099]
             [500, 599]

      The indexes span multiple ranges:

         index=0 means label 100
         ...
         index 99 means label 199
         index 100 means label 1000
         index 199 means label 1099
         ...
         index 200 means label 500
         ...

   The RI LSA can be advertised at any of the defined flooding scopes
   (link, area, or autonomous system (AS)).  For the purpose of SID/
   Label Range TLV advertisement, area-scoped flooding is REQUIRED.

3.3.  SR Local Block TLV

   The SR Local Block TLV (SRLB TLV) contains the range of labels the
   node has reserved for local SIDs.  SIDs from the SRLB MAY be used for
   Adjacency-SIDs, but also by components other than the OSPF protocol.
   As an example, an application or a controller may instruct the router
   to allocate a specific local SID.  Some controllers or applications
   may use the control plane to discover the available set of local SIDs
   on a particular router.  In such cases, the SRLG is advertised in the
   control plane.  The requirement to advertise the SRLB is further
   described in [I-D.ietf-spring-segment-routing-mpls].  The SRLB TLV is
   used to advertise the SRLB.

   The SRLB TLV is a top-level TLV of the Router Information Opaque LSA
   (defined in [RFC7770]).

   The SRLB TLV MAY appear multiple times in the Router Information
   Opaque LSA and has the following format:





Psenak, et al.           Expires April 23, 2018                 [Page 8]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              Type             |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                    Range Size                 |   Reserved    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        Sub-TLVs (variable)                    |
   +-                                                             -+
   |                                                               |
   +                                                               +

   where:

      Type: 14

      Length: Variable, in octets, dependent on Sub-TLVs.

      Range Size: 3-octet SID/label range size (i.e., the number of SIDs
      or labels in the range including the first SID/label).  It MUST be
      greater than 0.

   Initially, the only supported Sub-TLV is the SID/Label Sub-TLV as
   defined in Section 2.1.  The SID/Label Sub-TLV MUST be included in
   the SRLB TLV.  The SID/Label advertised in the SID/Label Sub-TLV
   represents the first SID/Label in the advertised range.

   Only a single SID/Label Sub-TLV MAY be advertised in the SRLB TLV.
   If more then one SID/Label Sub-TLVs are present, the SRLB TLV MUST be
   ignored.

   The originating router MUST NOT advertise overlapping ranges.

   Each time a SID from the SRLB is allocated, it SHOULD also be
   reported to all components (e.g., controller or applications) in
   order for these components to have an up-to-date view of the current
   SRLB allocation.  This is required to avoid collisions between
   allocation instructions.

   Within the context of OSPF, the reporting of local SIDs is done
   through OSPF Sub-TLVs such as the Adjacency-SID (Section 6).
   However, the reporting of allocated local SIDs may also be done
   through other means and protocols which are outside the scope of this
   document.

   A router advertising the SRLB TLV may also have other label ranges,
   outside of the SRLB, used for its local allocation purposes which are
   NOT advertised in the SRLB TLV.  For example, it is possible that an



Psenak, et al.           Expires April 23, 2018                 [Page 9]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


   Adjacency-SID is allocated using a local label that is not part of
   the SRLB.

   The RI LSA can be advertised at any of the defined flooding scopes
   (link, area, or autonomous system (AS)).  For the purpose of SRLB TLV
   advertisement, area-scoped flooding is REQUIRED.

3.4.  SRMS Preference TLV

   The Segment Routing Mapping Server Preference TLV (SRMS Preference
   TLV) is used to advertise a preference associated with the node that
   acts as an SR Mapping Server.  The role of an SRMS is described in
   [I-D.ietf-spring-segment-routing-ldp-interop].  SRMS preference is
   defined in [I-D.ietf-spring-conflict-resolution].

   The SRMS Preference TLV is a top-level TLV of the Router Information
   Opaque LSA (defined in [RFC7770]).

   The SRMS Preference TLV MAY only be advertised once in the Router
   Information Opaque LSA and has the following format:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              Type             |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Preference    |                 Reserved                    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   where:

      Type: 13

      Length: 4 octets

      Preference: 1 octet.  SRMS preference value from 0 to 255.

   When multiple SRMS Preference TLVs are received from a given router,
   the receiver SHOULD use the first occurrence of the TLV in the Router
   Information LSA.  If the SRMS Preference TLV appears in multiple
   Router Information LSAs that have different flooding scopes, the SRMS
   Preference TLV in the Router Information LSA with the narrowest
   flooding scope SHOULD be used.  If the SRMS Preference TLV appears in
   multiple Router Information LSAs that have the same flooding scope,
   the SRMS Preference TLV in the Router Information LSA with the
   numerically smallest Instance ID SHOULD be used and subsequent
   instances of the SRMS Preference TLV SHOULD be ignored.




Psenak, et al.           Expires April 23, 2018                [Page 10]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


   The RI LSA can be advertised at any of the defined flooding scopes
   (link, area, or autonomous system (AS)).  For the purpose of the SRMS
   Preference TLV advertisement, AS-scoped flooding SHOULD be used.
   This is because SRMS servers can be located in a different area then
   consumers of the SRMS advertisements.  If the SRMS advertisements
   from the SRMS server are only used inside the SRMS server's area,
   area-scoped flooding MAY be used.

4.  OSPF Extended Prefix Range TLV

   In some cases it is useful to advertise attributes for a range of
   prefixes.  The Segment Routing Mapping Server, which is described in
   [I-D.ietf-spring-segment-routing-ldp-interop], is an example where we
   need a single advertisement to advertise SIDs for multiple prefixes
   from a contiguous address range.

   The OSPF Extended Prefix Range TLV, which is a top level TLV of the
   Extended Prefix LSA described in [RFC7684] is defined for this
   purpose.

   Multiple OSPF Extended Prefix Range TLVs MAY be advertised in each
   OSPF Extended Prefix Opaque LSA, but all prefix ranges included in a
   single OSPF Extended Prefix Opaque LSA MUST have the same flooding
   scope.  The OSPF Extended Prefix Range TLV has the following format:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              Type             |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | Prefix Length |     AF        |         Range Size            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Flags       |                Reserved                       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                     Address Prefix (variable)                 |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Sub-TLVs (variable)                      |
   +-                                                             -+
   |                                                               |

   where:

      Type: 2

      Length: Variable, in octets, dependent on Sub-TLVs.

      Prefix length: Length of prefix in bits.




Psenak, et al.           Expires April 23, 2018                [Page 11]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


      AF: Address family for the prefix.  Currently, the only supported
      value is 0 for IPv4 unicast.  The inclusion of address family in
      this TLV allows for future extension.

      Range size: Represents the number of prefixes that are covered by
      the advertisement.  The Range Size MUST NOT exceed the number of
      prefixes that could be satisfied by the prefix length without
      including the IPv4 multicast address range (224.0.0.0/3).

      Flags: Single octet field.  The following flags are defined:


     0  1  2  3  4  5  6  7
   +--+--+--+--+--+--+--+--+
   |IA|  |  |  |  |  |  |  |
   +--+--+--+--+--+--+--+--+

   where:

         IA-Flag: Inter-Area flag.  If set, advertisement is of inter-
         area type.  An ABR that is advertising the OSPF Extended Prefix
         Range TLV between areas MUST set this bit.

         This bit is used to prevent redundant flooding of Prefix Range
         TLVs between areas as follows:

            An ABR only propagates an inter-area Prefix Range
            advertisement from the backbone area to connected non-
            backbone areas if the advertisement is considered to be the
            best one.  The following rules are used to select the best
            range from the set of advertisements for the same Prefix
            Range:

               An ABR always prefers intra-area Prefix Range
               advertisements over inter-area advertisements.

               An ABR does not consider inter-area Prefix Range
               advertisements coming from non-backbone areas.

      Address Prefix: For the address family IPv4 unicast, the prefix
      itself is encoded as a 32-bit value.  The default route is
      represented by a prefix of length 0.  Prefix encoding for other
      address families is beyond the scope of this specification.








Psenak, et al.           Expires April 23, 2018                [Page 12]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


5.  Prefix SID Sub-TLV

   The Prefix SID Sub-TLV is a Sub-TLV of the OSPF Extended Prefix TLV
   described in [RFC7684] and the OSPF Extended Prefix Range TLV
   described in Section 4.  It MAY appear more than once in the parent
   TLV and has the following format:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              Type             |             Length            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      Flags    |   Reserved    |      MT-ID    |    Algorithm  |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                     SID/Index/Label (variable)                |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   where:

      Type: 2

      Length: 7 or 8 octets, dependent on the V-flag

      Flags: Single octet field.  The following flags are defined:


     0  1  2  3  4  5  6  7
   +--+--+--+--+--+--+--+--+
   |  |NP|M |E |V |L |  |  |
   +--+--+--+--+--+--+--+--+

   where:

         NP-Flag: No-PHP flag.  If set, then the penultimate hop MUST
         NOT pop the Prefix-SID before delivering packets to the node
         that advertised the Prefix-SID.

         M-Flag: Mapping Server Flag.  If set, the SID was advertised by
         a Segment Routing Mapping Server as described in
         [I-D.ietf-spring-segment-routing-ldp-interop].

         E-Flag: Explicit-Null Flag.  If set, any upstream neighbor of
         the Prefix-SID originator MUST replace the Prefix-SID with the
         Explicit-NULL label (0 for IPv4) before forwarding the packet.

         V-Flag: Value/Index Flag.  If set, then the Prefix-SID carries
         an absolute value.  If not set, then the Prefix-SID carries an
         index.



Psenak, et al.           Expires April 23, 2018                [Page 13]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


         L-Flag: Local/Global Flag.  If set, then the value/index
         carried by the Prefix-SID has local significance.  If not set,
         then the value/index carried by this Sub-TLV has global
         significance.

         Other bits: Reserved.  These MUST be zero when sent and are
         ignored when received.

      MT-ID: Multi-Topology ID (as defined in [RFC4915]).

      Algorithm: Single octet identifying the algorithm the Prefix-SID
      is associated with as defined in Section 3.1.

      A router receiving a Prefix-SID from a remote node and with an
      algorithm value that such remote node has not advertised in the
      SR-Algorithm Sub-TLV (Section 3.1) MUST ignore the Prefix-SID Sub-
      TLV.

      SID/Index/Label: According to the V and L flags, it contains
      either:

         A 32-bit index defining the offset in the SID/Label space
         advertised by this router.

         A 24-bit label where the 20 rightmost bits are used for
         encoding the label value.

   If an OSPF router advertises multiple Prefix-SIDs for the same
   prefix, topology and algorithm, all of them MUST be ignored.

   When calculating the outgoing label for the prefix, the router MUST
   take into account, as described below, the E, NP and M flags
   advertised by the next-hop router if that router advertised the SID
   for the prefix.  This MUST be done regardless of whether the next-hop
   router contributes to the best path to the prefix.

   The NP-Flag (No-PHP) MUST be set and the E-flag MUST be clear for
   Prefix-SIDs allocated to inter-area prefixes that are originated by
   the ABR based on intra-area or inter-area reachability between areas,
   unless the advertised prefix is directly attached to the ABR.

   The NP-Flag (No-PHP) MUST be set and the E-flag MUST be clear for
   Prefix-SIDs allocated to redistributed prefixes, unless the
   redistributed prefix is directly attached to the ASBR.

   If the NP-Flag is not set, then any upstream neighbor of the Prefix-
   SID originator MUST pop the Prefix-SID.  This is equivalent to the




Psenak, et al.           Expires April 23, 2018                [Page 14]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


   penultimate hop popping mechanism used in the MPLS dataplane.  If the
   NP-flag is not set, then the received E-flag is ignored.

   If the NP-flag is set then:

      If the E-flag is not set, then any upstream neighbor of the
      Prefix-SID originator MUST keep the Prefix-SID on top of the
      stack.  This is useful when the originator of the Prefix-SID must
      stitch the incoming packet into a continuing MPLS LSP to the final
      destination.  This could occur at an Area Border Router (prefix
      propagation from one area to another) or at an AS Boundary Router
      (prefix propagation from one domain to another).

      If the E-flag is set, then any upstream neighbor of the Prefix-SID
      originator MUST replace the Prefix-SID with an Explicit-NULL
      label.  This is useful, e.g., when the originator of the Prefix-
      SID is the final destination for the related prefix and the
      originator wishes to receive the packet with the original EXP
      bits.

   When the M-Flag is set, the NP-flag and the E-flag MUST be ignored at
   reception.

   As the Mapping Server does not specify the originator of a prefix
   advertisement, it is not possible to determine PHP behavior solely
   based on the Mapping Server advertisement.  However, PHP behavior
   SHOULD be done in following cases:

      The Prefix is intra-area type and the downstream neighbor is the
      originator of the prefix.

      The Prefix is inter-area type and downstream neighbor is an ABR,
      which is advertising prefix reachability and is also generating
      the Extended Prefix TLV with the A-flag set for this prefix as
      described in section 2.1 of [RFC7684].

      The Prefix is external type and downstream neighbor is an ASBR,
      which is advertising prefix reachability and is also generating
      the Extended Prefix TLV with the A-flag set for this prefix as
      described in section 2.1 of [RFC7684].

   When a Prefix-SID is advertised in an Extended Prefix Range TLV, then
   the value advertised in the Prefix SID Sub-TLV is interpreted as a
   starting SID/Label value.

   Example 1: If the following router addresses (loopback addresses)
   need to be mapped into the corresponding Prefix SID indexes:




Psenak, et al.           Expires April 23, 2018                [Page 15]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


             Router-A: 192.0.2.1/32, Prefix-SID: Index 1
             Router-B: 192.0.2.2/32, Prefix-SID: Index 2
             Router-C: 192.0.2.3/32, Prefix-SID: Index 3
             Router-D: 192.0.2.4/32, Prefix-SID: Index 4

   then the Prefix field in the Extended Prefix Range TLV would be set
   to 192.0.2.1, Prefix Length would be set to 32, Range Size would be
   set to 4, and the Index value in the Prefix-SID Sub-TLV would be set
   to 1.

   Example 2: If the following prefixes need to be mapped into the
   corresponding Prefix-SID indexes:

             192.0.2.0/30, Prefix-SID: Index 51
             192.0.2.4/30, Prefix-SID: Index 52
             192.0.2.8/30, Prefix-SID: Index 53
             192.0.2.12/30, Prefix-SID: Index 54
             192.0.2.16/30, Prefix-SID: Index 55
             192.0.2.20/30, Prefix-SID: Index 56
             192.0.2.24/30, Prefix-SID: Index 57

   then the Prefix field in the Extended Prefix Range TLV would be set
   to 192.0.2.0, Prefix Length would be set to 30, Range Size would be
   7, and the Index value in the Prefix-SID Sub-TLV would be set to 51.

6.  Adjacency Segment Identifier (Adj-SID)

   An Adjacency Segment Identifier (Adj-SID) represents a router
   adjacency in Segment Routing.

6.1.  Adj-SID Sub-TLV

   Adj-SID is an optional Sub-TLV of the Extended Link TLV defined in
   [RFC7684].  It MAY appear multiple times in the Extended Link TLV.
   The Adj-SID Sub-TLV has the following format:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              Type             |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Flags     |    Reserved   |   MT-ID       |  Weight       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                   SID/Label/Index (variable)                  |
   +---------------------------------------------------------------+

   where:




Psenak, et al.           Expires April 23, 2018                [Page 16]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


      Type: 2

      Length: 7 or 8 octets, dependent on the V flag.

      Flags: Single octet field containing the following flags:

    0 1 2 3 4 5 6 7
   +-+-+-+-+-+-+-+-+
   |B|V|L|G|P|     |
   +-+-+-+-+-+-+-+-+

   where:

         B-Flag: Backup Flag.  If set, the Adj-SID refers to an
         adjacency that is eligible for protection (e.g., using IPFRR or
         MPLS-FRR) as described in section 3.5 of
         [I-D.ietf-spring-segment-routing].

         The V-Flag: Value/Index Flag.  If set, then the Adj-SID carries
         an absolute value.  If not set, then the Adj-SID carries an
         index.

         The L-Flag: Local/Global Flag.  If set, then the value/index
         carried by the Adj-SID has local significance.  If not set,
         then the value/index carried by this Sub-TLV has global
         significance.

         The G-Flag: Group Flag.  When set, the G-Flag indicates that
         the Adj-SID refers to a group of adjacencies (and therefore MAY
         be assigned to other adjacencies as well).

         P-Flag.  Persistent flag.  When set, the P-Flag indicates that
         the Adj-SID is persistently allocated, i.e., the Adj-SID value
         remains consistent across router restart and/or interface flap.

         Other bits: Reserved.  These MUST be zero when sent and are
         ignored when received.

      MT-ID: Multi-Topology ID (as defined in [RFC4915].

      Weight: Weight used for load-balancing purposes.  The use of the
      weight is defined in [I-D.ietf-spring-segment-routing].

      SID/Index/Label: According to the V and L flags, it contains
      either:

         A 32-bit index defining the offset in the SID/Label space
         advertised by this router.



Psenak, et al.           Expires April 23, 2018                [Page 17]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


         A 24-bit label where the 20 rightmost bits are used for
         encoding the label value.

   An SR capable router MAY allocate an Adj-SID for each of its
   adjacencies and set the B-Flag when the adjacency is eligible for
   protection by an FRR mechanism (IP or MPLS) as described in section
   3.5 of [I-D.ietf-spring-segment-routing].

   An SR capable router MAY allocate more than one Adj-SID to an
   adjacency

   An SR capable router MAY allocate the same Adj-SID to different
   adjacencies

   When the P-flag is not set, the Adj-SID MAY be persistent.  When the
   P-flag is set, the Adj-SID MUST be persistent.

6.2.  LAN Adj-SID Sub-TLV

   LAN Adj-SID is an optional Sub-TLV of the Extended Link TLV defined
   in [RFC7684].  It MAY appear multiple times in the Extended-Link TLV.
   It is used to advertise a SID/Label for an adjacency to a non-DR
   router on a broadcast, NBMA, or hybrid [RFC6845] network.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              Type             |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Flags     |    Reserved   |     MT-ID     |    Weight     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                        Neighbor ID                            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                    SID/Label/Index (variable)                 |
   +---------------------------------------------------------------+

   where:

      Type: 3

      Length: 11 or 12 octets, dependent on V-flag.

      Flags: same as in Section 6.1

      MT-ID: Multi-Topology ID (as defined in [RFC4915].

      Weight: Weight used for load-balancing purposes.  The use of the
      weight is defined in [I-D.ietf-spring-segment-routing].



Psenak, et al.           Expires April 23, 2018                [Page 18]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


      Neighbor ID: The Router ID of the neighbor for which the LAN-Adj-
      SID is advertised.

      SID/Index/Label: According to the V and L flags, it contains
      either:

         A 32-bit index defining the offset in the SID/Label space
         advertised by this router.

         A 24-bit label where the 20 rightmost bits are used for
         encoding the label value.

      When the P-flag is not set, the Adj-SID MAY be persistent.  When
      the P-flag is set, the Adj-SID MUST be persistent.

7.  Elements of Procedure

7.1.  Intra-area Segment routing in OSPFv2

   An OSPFv2 router that supports segment routing MAY advertise Prefix-
   SIDs for any prefix to which it is advertising reachability (e.g., a
   loopback IP address as described in Section 5).

   A Prefix-SID can also be advertised by the SR Mapping Servers (as
   described in [I-D.ietf-spring-segment-routing-ldp-interop]).  A
   Mapping Server advertises Prefix-SIDs for remote prefixes that exist
   in the OSPFv2 routing domain.  Multiple Mapping Servers can advertise
   Prefix-SIDs for the same prefix, in which case the same Prefix-SID
   MUST be advertised by all of them.  The flooding scope of the OSPF
   Extended Prefix Opaque LSA that is generated by the SR Mapping Server
   could be either area-scoped or AS-scoped and is determined based on
   the configuration of the SR Mapping Server.

   An SR Mapping Server MUST use the OSPF Extended Prefix Range TLV when
   advertising SIDs for prefixes.  Prefixes of different route-types can
   be combined in a single OSPF Extended Prefix Range TLV advertised by
   an SR Mapping Server.  Because the OSPF Extended Prefix Range TLV
   doesn't include a Route-Type field, as in the OSPF Extended Prefix
   TLV, it is possible to include adjacent prefixes from different
   Route-Types in the OSPF Extended Prefix Range TLV.

   Area-scoped OSPF Extended Prefix Range TLVs are propagated between
   areas.  Similar to propagation of prefixes between areas, an ABR only
   propagates the OSPF Extended Prefix Range TLV that it considers to be
   the best from the set it received.  The rules used to pick the best
   OSPF Extended Prefix Range TLV are described in Section 4.





Psenak, et al.           Expires April 23, 2018                [Page 19]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


   When propagating an OSPF Extended Prefix Range TLV between areas,
   ABRs MUST set the IA-Flag, that is used to prevent redundant flooding
   of the OSPF Extended Prefix Range TLV between areas as described in
   Section 4.

7.2.  Inter-area Segment routing in OSPFv2

   In order to support SR in a multi-area environment, OSPFv2 must
   propagate Prefix-SID information between areas.  The following
   procedure is used to propagate Prefix SIDs between areas.

   When an OSPF ABR advertises a Type-3 Summary LSA from an intra-area
   prefix to all its connected areas, it will also originate an Extended
   Prefix Opaque LSA, as described in [RFC7684].  The flooding scope of
   the Extended Prefix Opaque LSA type will be set to area-local scope.
   The route-type in the OSPF Extended Prefix TLV is set to inter-area.
   The Prefix-SID Sub-TLV will be included in this LSA and the Prefix-
   SID value will be set as follows:

      The ABR will look at its best path to the prefix in the source
      area and find the advertising router associated with the best path
      to that prefix.

      The ABR will then determine if such router advertised a Prefix-SID
      for the prefix and use it when advertising the Prefix-SID to other
      connected areas.

      If no Prefix-SID was advertised for the prefix in the source area
      by the router that contributes to the best path to the prefix, the
      originating ABR will use the Prefix-SID advertised by any other
      router when propagating the Prefix-SID for the prefix to other
      areas.

   When an OSPF ABR advertises Type-3 Summary LSAs from an inter-area
   route to all its connected areas, it will also originate an Extended
   Prefix Opaque LSA, as described in [RFC7684].  The flooding scope of
   the Extended Prefix Opaque LSA type will be set to area-local scope.
   The route-type in OSPF Extended Prefix TLV is set to inter-area.  The
   Prefix-SID Sub-TLV will be included in this LSA and the Prefix-SID
   will be set as follows:

      The ABR will look at its best path to the prefix in the backbone
      area and find the advertising router associated with the best path
      to that prefix.

      The ABR will then determine if such router advertised a Prefix-SID
      for the prefix and use it when advertising the Prefix-SID to other
      connected areas.



Psenak, et al.           Expires April 23, 2018                [Page 20]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


      If no Prefix-SID was advertised for the prefix in the backbone
      area by the ABR that contributes to the best path to the prefix,
      the originating ABR will use the Prefix-SID advertised by any
      other router when propagating the Prefix-SID for the prefix to
      other areas.

7.3.  Segment Routing for External Prefixes

   Type-5 LSAs are flooded domain wide.  When an ASBR, which supports
   SR, generates Type-5 LSAs, it should also originate Extended Prefix
   Opaque LSAs, as described in [RFC7684].  The flooding scope of the
   Extended Prefix Opaque LSA type is set to AS-wide scope.  The route-
   type in the OSPF Extended Prefix TLV is set to external.  The Prefix-
   SID Sub-TLV is included in this LSA and the Prefix-SID value will be
   set to the SID that has been reserved for that prefix.

   When an NSSA ABR translates Type-7 LSAs into Type-5 LSAs, it should
   also advertise the Prefix-SID for the prefix.  The NSSA ABR
   determines its best path to the prefix advertised in the translated
   Type-7 LSA and finds the advertising router associated with that
   path.  If the advertising router has advertised a Prefix-SID for the
   prefix, then the NSSA ABR uses it when advertising the Prefix-SID for
   the Type-5 prefix.  Otherwise, the Prefix-SID advertised by any other
   router will be used.

7.4.  Advertisement of Adj-SID

   The Adjacency Segment Routing Identifier (Adj-SID) is advertised
   using the Adj-SID Sub-TLV as described in Section 6.

7.4.1.  Advertisement of Adj-SID on Point-to-Point Links

   An Adj-SID MAY be advertised for any adjacency on a P2P link that is
   in neighbor state 2-Way or higher.  If the adjacency on a P2P link
   transitions from the FULL state, then the Adj-SID for that adjacency
   MAY be removed from the area.  If the adjacency transitions to a
   state lower then 2-Way, then the Adj-SID advertisement MUST be
   withdrawn from the area.

7.4.2.  Adjacency SID on Broadcast or NBMA Interfaces

   Broadcast, NBMA, or hybrid [RFC6845] networks in OSPF are represented
   by a star topology where the Designated Router (DR) is the central
   point to which all other routers on the broadcast, NBMA, or hybrid
   network connect.  As a result, routers on the broadcast, NBMA, or
   hybrid network advertise only their adjacency to the DR.  Routers
   that do not act as DR do not form or advertise adjacencies with each




Psenak, et al.           Expires April 23, 2018                [Page 21]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


   other.  They do, however, maintain 2-Way adjacency state with each
   other and are directly reachable.

   When Segment Routing is used, each router on the broadcast, NBMA, or
   hybrid network MAY advertise the Adj-SID for its adjacency to the DR
   using the Adj-SID Sub-TLV as described in Section 6.1.

   SR capable routers MAY also advertise a LAN-Adj-SID for other
   neighbors (e.g., BDR, DR-OTHER) on the broadcast, NBMA, or hybrid
   network using the LAN-ADJ-SID Sub-TLV as described in Section 6.2.

8.  IANA Considerations

   This specification updates several existing OSPF registries.

8.1.  OSPF OSPF Router Information (RI) TLVs Registry

   o 8 (IANA Preallocated) - SR-Algorithm TLV

   o 9 (IANA Preallocated) - SID/Label Range TLV

   o 13 - SRMS Preference TLV

   o 14 - SR Local Block TLV

8.2.  OSPF Extended Prefix LSA TLV Registry

   Following values are allocated:

   o 2 - OSPF Extended Prefix Range TLV

8.3.  OSPF Extended Prefix LSA Sub-TLV Registry

   Following values are allocated:

   o 1 - SID/Label Sub-TLV

   o 2 - Prefix SID Sub-TLV

8.4.  OSPF Extended Link LSA Sub-TLV Registry

   Following initial values are allocated:

   o 1 - SID/Label Sub-TLV

   o 2 - Adj-SID Sub-TLV

   o 3 - LAN Adj-SID/Label Sub-TLV



Psenak, et al.           Expires April 23, 2018                [Page 22]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


8.5.  SR-Algorithm Registry

   IANA is requested to set up a registry called "SR-Algorithm Type".
   The registration policy for this registry is "Standards Action"
   ([RFC8126] and [RFC7120]).

   Values in this registry must come from the range 0-255.

   The initial values in the SR-Algorithm Type registry are:

      0: Shortest Path First (SPF) algorithm based on link metric.  This
      is the standard shortest path algorithm as computed by the IGP
      protocol.  Consistent with the deployed practice for link-state
      protocols, Algorithm 0 permits any node to overwrite the SPF path
      with a different path based on its local policy.

      1: Strict Shortest Path First (SPF) algorithm based on link
      metric.  The algorithm is identical to Algorithm 0 but Algorithm 1
      requires that all nodes along the path will honor the SPF routing
      decision.  Local policy at the node claiming support for Algorithm
      1 MUST NOT alter the SPF paths computed by Algorithm 1.

9.  Implementation Status

   An implementation survey with seven questions related to the
   implementer's support of OSPFv2 Segment Routing was sent to the OSPF
   WG list and several known implementers.  This section contains
   responses from three implementers who completed the survey.  No
   external means were used to verify the accuracy of the information
   submitted by the respondents.  The respondents are considered experts
   on the products they reported on.  Additionally, responses were
   omitted from implementers who indicated that they have not
   implemented the function yet.

   This section will be removed before publication as an RFC.

   Responses from Nokia (former Alcatel-Lucent):

   Link to a web page describing the implementation:
   https://infoproducts.alcatel-lucent.com/cgi-bin/dbaccessfilename.cgi/
   3HE10799AAAATQZZA01_V1_7450%20ESS%207750%20SR%20and%207950%20XRS%20Un
   icast%20Routing%20Protocols%20Guide%20R14.0.R1.pdf

   The implementation's level of maturity: Production.

   Coverage: We have implemented all sections and have support for the
   latest draft.




Psenak, et al.           Expires April 23, 2018                [Page 23]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


   Licensing: Part of the software package that needs to be purchased.

   Implementation experience: Great spec.  We also performed inter-
   operability testing with Cisco's OSPF Segment Routing implementation.

   Contact information: wim.henderickx@nokia.com

   Responses from Cisco Systems:

   Link to a web page describing the implementation:

   http://www.segment-routing.net/home/tutorial

   The implementation's level of maturity: Production.

   Coverage: All sections have been implemented according to the latest
   draft.

   Licensing: Part of a commercial software package.

   Implementation experience: Many aspects of the draft are result of
   the actual implementation experience, as the draft evolved from its
   initial version to the current one.  Interoperability testing with
   Alcatel-Lucent was performed, which confirmed the draft's ability to
   serve as a reference for the implementors.

   Contact information: ppsenak@cisco.com

   Responses from Juniper:

   The implementation's name and/or a link to a web page describing the
   implementation:

   Feature name is OSPF SPRING

   The implementation's level of maturity: To be released in 16.2
   (second half of 2016)

   Coverage: All sections implemented except Sections 4, and 6.

   Licensing: JUNOS Licensing needed.

   Implementation experience: NA

   Contact information: shraddha@juniper.net






Psenak, et al.           Expires April 23, 2018                [Page 24]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


10.  Security Considerations

   With the OSPFv2 segment routing extensions defined herein, OSPFv2
   will now program the MPLS data plane [RFC3031] in addition to the IP
   data plane.  Previously, LDP [RFC5036] or another label distribution
   mechanism was required to advertise MPLS labels and program the MPLS
   data plane.

   In general, the same types of attacks that can be carried out on the
   IP control plane can be carried out on the MPLS control plane
   resulting in traffic being misrouted in the respective data planes.
   However, the latter may be more difficult to detect and isolate.

   Existing security extensions as described in [RFC2328] and [RFC7684]
   apply to these segment routing extensions.  While OSPF is under a
   single administrative domain, there may be deployments where
   potential attackers have access to one or more networks in the OSPF
   routing domain.  In these deployments, stronger authentication
   mechanisms such as those specified in [RFC7474] SHOULD be used.

   Implementations must assure that malformed TLV and Sub-TLV defined in
   this document are detected and do not provide a vulnerability for
   attackers to crash the OSPFv2 router or routing process.  Reception
   of malformed TLV or Sub-TLV SHOULD be counted and/or logged for
   further analysis.  Logging of malformed TLVs and Sub-TLVs should be
   rate-limited to prevent a Denial of Service (DoS) attack (distributed
   or otherwise) from overloading the OSPF control plane.

11.  Contributors

   The following people gave a substantial contribution to the content
   of this document: Acee Lindem, Ahmed Bashandy, Martin Horneffer,
   Bruno Decraene, Stephane Litkowski, Igor Milojevic, Rob Shakir and
   Saku Ytti.

12.  Acknowledgements

   We would like to thank Anton Smirnov for his contribution.

   Thanks to Acee Lindem for the detail review of the draft,
   corrections, as well as discussion about details of the encoding.

13.  References








Psenak, et al.           Expires April 23, 2018                [Page 25]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


13.1.  Normative References

   [I-D.ietf-spring-segment-routing]
              Filsfils, C., Previdi, S., Decraene, B., Litkowski, S.,
              and R. Shakir, "Segment Routing Architecture", draft-ietf-
              spring-segment-routing-12 (work in progress), June 2017.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC4915]  Psenak, P., Mirtorabi, S., Roy, A., Nguyen, L., and P.
              Pillay-Esnault, "Multi-Topology (MT) Routing in OSPF",
              RFC 4915, DOI 10.17487/RFC4915, June 2007,
              <https://www.rfc-editor.org/info/rfc4915>.

   [RFC6845]  Sheth, N., Wang, L., and J. Zhang, "OSPF Hybrid Broadcast
              and Point-to-Multipoint Interface Type", RFC 6845,
              DOI 10.17487/RFC6845, January 2013,
              <https://www.rfc-editor.org/info/rfc6845>.

   [RFC7120]  Cotton, M., "Early IANA Allocation of Standards Track Code
              Points", BCP 100, RFC 7120, DOI 10.17487/RFC7120, January
              2014, <https://www.rfc-editor.org/info/rfc7120>.

   [RFC7684]  Psenak, P., Gredler, H., Shakir, R., Henderickx, W.,
              Tantsura, J., and A. Lindem, "OSPFv2 Prefix/Link Attribute
              Advertisement", RFC 7684, DOI 10.17487/RFC7684, November
              2015, <https://www.rfc-editor.org/info/rfc7684>.

   [RFC7770]  Lindem, A., Ed., Shen, N., Vasseur, JP., Aggarwal, R., and
              S. Shaffer, "Extensions to OSPF for Advertising Optional
              Router Capabilities", RFC 7770, DOI 10.17487/RFC7770,
              February 2016, <https://www.rfc-editor.org/info/rfc7770>.

   [RFC8126]  Cotton, M., Leiba, B., and T. Narten, "Guidelines for
              Writing an IANA Considerations Section in RFCs", BCP 26,
              RFC 8126, DOI 10.17487/RFC8126, June 2017,
              <https://www.rfc-editor.org/info/rfc8126>.

13.2.  Informative References

   [I-D.ietf-spring-conflict-resolution]
              Ginsberg, L., Psenak, P., Previdi, S., and M. Pilka,
              "Segment Routing MPLS Conflict Resolution", draft-ietf-
              spring-conflict-resolution-05 (work in progress), July
              2017.



Psenak, et al.           Expires April 23, 2018                [Page 26]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


   [I-D.ietf-spring-segment-routing-ldp-interop]
              Filsfils, C., Previdi, S., Bashandy, A., Decraene, B., and
              S. Litkowski, "Segment Routing interworking with LDP",
              draft-ietf-spring-segment-routing-ldp-interop-09 (work in
              progress), September 2017.

   [I-D.ietf-spring-segment-routing-mpls]
              Filsfils, C., Previdi, S., Bashandy, A., Decraene, B.,
              Litkowski, S., and R. Shakir, "Segment Routing with MPLS
              data plane", draft-ietf-spring-segment-routing-mpls-10
              (work in progress), June 2017.

   [RFC2328]  Moy, J., "OSPF Version 2", STD 54, RFC 2328,
              DOI 10.17487/RFC2328, April 1998,
              <https://www.rfc-editor.org/info/rfc2328>.

   [RFC7474]  Bhatia, M., Hartman, S., Zhang, D., and A. Lindem, Ed.,
              "Security Extension for OSPFv2 When Using Manual Key
              Management", RFC 7474, DOI 10.17487/RFC7474, April 2015,
              <https://www.rfc-editor.org/info/rfc7474>.

   [RFC7855]  Previdi, S., Ed., Filsfils, C., Ed., Decraene, B.,
              Litkowski, S., Horneffer, M., and R. Shakir, "Source
              Packet Routing in Networking (SPRING) Problem Statement
              and Requirements", RFC 7855, DOI 10.17487/RFC7855, May
              2016, <https://www.rfc-editor.org/info/rfc7855>.

Authors' Addresses

   Peter Psenak (editor)
   Cisco Systems, Inc.
   Apollo Business Center
   Mlynske nivy 43
   Bratislava  821 09
   Slovakia

   Email: ppsenak@cisco.com


   Stefano Previdi (editor)
   Cisco Systems, Inc.
   Via Del Serafico, 200
   Rome  00142
   Italy

   Email: stefano@previdi.net





Psenak, et al.           Expires April 23, 2018                [Page 27]

Internet-Draft     OSPF Extensions for Segment Routing      October 2017


   Clarence Filsfils
   Cisco Systems, Inc.
   Brussels
   Belgium

   Email: cfilsfil@cisco.com


   Hannes Gredler
   RtBrick Inc.

   Email: hannes@rtbrick.com


   Rob Shakir
   Google, Inc.
   1600 Amphitheatre Parkway
   Mountain View, CA  94043
   US

   Email: robjs@google.com


   Wim Henderickx
   Nokia
   Copernicuslaan 50
   Antwerp  2018
   BE

   Email: wim.henderickx@nokia.com


   Jeff Tantsura
   Individual
   US

   Email: jefftant.ietf@gmail.com














Psenak, et al.           Expires April 23, 2018                [Page 28]
